    //categoies/////////////////////////////////////////////////
    const corals = [{
            img: "./img/animals/moerisia_maeotica.png",
            title: "Меризія азовська Moerisia maeotica",
            taxonomic: "Клас — Гідроїди (Hydrozoa), ряд — Атекати (Athecata)",
            status: "Зникаючий",
            count: "Чисельність як правило низька, зустрічаються поодинокі особини, хоча в окремі роки в зх. частині Таганрозької затоки Азовського моря вид на стадії медузоїда відмічався як масовий компонент зоопланктону",
            danger: "Забруднення водойм, підвищення солоності у прибережних акваторіях морів"
        },
        {
            img: "./img/animals/olindias_inexpectata.png",
            title: "Оліндіас несподіваний Olindias inexpectata",
            taxonomic: "Клас — Гідроїди (Hydrozoa), ряд — Лімномедузи (Limnomedusae)",
            status: "Вразливий",
            count: "Даних по чисельності немає, зустрічаються поодинокі особини",
            danger: "забруднення водойм"
        }
    ];

    const parasite = [{
            img: "./img/animals/axonolaimus_sera.png",
            title: "Аксонолайм замковий Axonolaimus sera",
            taxonomic: "Клас — Нематоди (Nematoda), ряд — Арелайміди (Araelaimida)",
            status: "Вразливий",
            count: "60–10000 особин на 1 кг сирої маси рослин",
            danger: "забруднення водойм, руйнування біотопів бентосу"
        },
        {
            img: "./img/animals/chromadorina_bioculata.png",
            title: "Хромадоріна двоока Chromadorina bioculata",
            taxonomic: "Клас — Нематоди (Nematoda), ряд — Арелайміди (Araelaimida)",
            status: "Зникаючий",
            count: "600–800 тис. особин на 1 кг сирої маси рослин",
            danger: "забруднення водойм, знищення угруповань макрофітів"
        }
    ];

    const ring_worm = [{
            img: "./img/animals/eisenia_gordejef.png",
            title: "Ейзенія гордєєва Eisenia gordejef",
            taxonomic: "Клас — Малощетинкові черви (Oligochaeta), ряд — Дощовики (Lumbricomorpha)",
            status: "Вразливий",
            count: "Точних даних щодо чисельності виду немає. Відмічався з невисокою щільністю",
            danger: "розорювання цілинних земель, забруднення отрутохімікатами та надмірним внесенням добрив, інші порушення нормальних умов природного середо вища, його господарське освоєння. Необхідна охорона природних біотопів"
        },
        {
            img: "./img/animals/archaeobdella_esmonti.png",
            title: "Археобдела каспійська Archaeobdella esmonti",
            taxonomic: "Клас — П’явки (Hirudinea), ряд — Безхоботні п’явки (Arhynchobdellida)",
            status: "Вразливий",
            count: "В біотопах може зустрічатися в значній чисельності",
            danger: "вид чутливий до різких змін умов проживання; зокрема, нестача кисню та забруднення води можуть спричинити зменшення чисельності"
        }
    ];

    const tarantula = [{
            img: "./img/animals/coranus_griseus.png",
            title: "Коранус сірий Coranus griseus",
            taxonomic: "Клас — Комахи (Insecta), ряд — Напівтвердокрилі або клопи (Hemiptera), родина — Редувіїди (Reduviidae)",
            status: "Рідкісний",
            count: "Досить рідкісний вид в Україні. Можливо, чисельність виду залежить від ступеня конкуренції з близькими видами (наприклад з Coranus tuberculifer)",
            danger: "Заходи охорони не проводились. Доцільно створювати ентомологічні заказники в місцях реєстрації виду"
        },
        {
            img: "./img/animals/galeodes_araneoides.png",
            title: "Сольпуга звичайна Galeodes araneoides",
            taxonomic: "Клас — Ракоподібні (Crustacea), ряд — Сольпуги (Solifugae)",
            status: "Рідкісний",
            count: "Даних про чисельність немає",
            danger: "Знищення природних степових ділянок"
        }
    ];

    const shellfish = [{
            img: "./img/animals/turricaspia_lincta.png",
            title: "Турикаспія лінкта Turricaspia lincta Milaschevich",
            taxonomic: "Клас — Черевоногі (Gastropoda), ряд — Рісоіподібні (Rissoiformes)",
            status: "Рідкісний",
            count: "Вид формує постійні популяції невеликої щільності (зазвичай від 2 до 30 особин на 1 м2). До різкого зменшення чисельності або навіть повного знищення виду може призвести замулення та забруднення води, значне падіння рівня води в дельтах річок і лиманах внаслідок зарегулювання і забирання води на господарські потреби",
            danger: "Знищення біотопів"
        },
        {
            img: "./img/animals/pomatias_rivulare.png",
            title: "Равлик кришечковий струмковий Pomatias rivulare",
            taxonomic: "Клас — Черевоногі (Gastropoda), ряд — Передньожаберні (Prosobranchiata)",
            status: "Вразливий",
            count: "У головних біотопах щільність молюска 10–15 особин на 1 м2",
            danger: "деградація природних місць мешкання"
        }
    ];

    const cat = [{
            img: "./img/animals/aquila_chrysaetos.png",
            title: "Беркут Aquila chrysaetos",
            taxonomic: "Клас — Птахи (Aves), ряд — Соколопо-дібні (Falconiformes), родина — Яструбові (Accipitridae). Один з 9-ти видів роду; один з 5-ти видів роду у фауні України",
            status: "Вразливий",
            count: "Наприкінці ХІХ — на поч. ХХ ст. гніздився не лише в Карпатах, але і на територіях сучасних Кіровоградської, Чернігівської, Житомирської, Рівненської, Дніпропетровської обл. У 1940– 1954 рр. чисельність осілої карпатської популяції не перевищувала 10–11 пар. У середині 1960-х рр. в Карпатах налічувалось 6–8 пар. Зараз карпатську популяцію оцінюють у 10–15 пар. Європейську гніздову популяцію у 2004 р. оцінювали у 8,4–11 тис. пар. На стан виду негативно впливають: знищення старих ділянок лісу, де птахи гніздяться; скорочення кормової бази; вбивство птахів для виготовлення опудал; випадкове потрапляння у мисливські пастки",
            danger: "Забруднення водойм, підвищення солоності у прибережних акваторіях морів"
        },
        {
            img: "./img/animals/lissotriton_montandoni.png",
            title: "Тритон карпатський Lissotriton montandoni",
            taxonomic: "Клас — Земноводні (Amphibia), ряд — Хвостаті земноводні (Caudata), родина — Саламандрові (Salamandridae), рід — Малий [гладкий] тритон (Lissotriton)",
            status: "Вразливий",
            count: "У Закарпатті — весною 20−80 ос. на 100 м берегової лінії, в Івано-Франківській та Львівській обл. — від 18–20 до 143 ос./10 м2, у Чернівецькій та Івано-Франківській обл. від 4,6 до 19,6 ос./м2 площі водойм. Чисельность зменшується при трансформації біотопів, гинуть від автотранспорту при використанні для нересту калюж на путівцях",
            danger: "Зберігаються на природоохоронних територіях; спеціальні заходи з охорони відсутні"
        }
    ];

    const cactus = [{
            img: "./img/plants/isoëtes_lacustris.png",
            title: "Молодильник озерний Isoetes lacustris",
            taxonomic: "Родина Молодильникові — Isoëtaceae",
            status: "Вразливий",
            count: "Утворює монодомінантні зарості, популяції представлені у вигляді широких щільних смуг на мілководді озер (оз. Біле в Рівненському ПЗ, оз. Луки Ратнівського р-ну, Воронки, Луко Володимирецького р-ну, озера Велике, Середнє Зарічнянского р-ну), також трапляється окремими плямами (оз. Світязь і Пісочне Шацького НПП та оз. Любче Ковельського р-ну)",
            danger: "Забруднення озер (антропогенна евтрофікація). В останнє десятиліття виявлено ряд нових місцезнаходжень, де вид раніше не фіксувався"
        },
        {
            img: "./img/plants/huperzia_selago.png",
            title: "Баранець звичайний Huperzia selago (L.) Bernh. ex Schrank et Mart.",
            taxonomic: "Родина Баранцеві — Huperziaceae",
            status: "Неоцінений",
            count: "У рівнинних районах переважно поодинокі куртини і їх групи чисельністю до десяти. У Карпатах часто трапляються чисельністю по кілька десятків (сотень) куртин",
            danger: "Не має підземних запасаючих органів і бічних бруньок, тому зламані пагони не відновлюються. Зникає внаслідок підвищення ценотичної конкуренції, не переносить лісових пожеж, рекреаційного навантаження"
        }
    ];

    const mashroom = [{
            img: "./img/plants/gyromitra_slonevskii.png",
            title: "Строчок Слоневського Gyromitra slonevskii Heluta",
            taxonomic: "Родина Дісцинові — Discinaceae",
            status: "Рідкісний",
            count: "Трапляється дуже рідко, переважно групами з декількох плодових тіл",
            danger: "Знищується людиною насамперед як декоративний вид"
        },
        {
            img: "./img/plants/helvella_monachella.png",
            title: "Гельвела монашка Helvella monachella (Scop.) Fr.",
            taxonomic: "Родина Гельвелові — Helvellaceae",
            status: "Вразливий",
            count: "Трапляється дуже рідко, поодинці або групами",
            danger: "Не досліджені"
        }
    ];

    const seaweed = [{
            img: "./img/plants/cladostephus_spongiosus.png",
            title: "Кладостефус губчастий Cladostephus spongiosus",
            taxonomic: "Родина Кладостефові — Cladostephaceae",
            status: "Рідкісний",
            count: "Трапляється групами",
            danger: "Антропогенний вплив (евтрофування водойм)"
        },
        {
            img: "./img/plants/stigeoclonium_fasciculare.png",
            title: "Стигеоклоніум пучкуватий Stigeoclonium fasciculare",
            taxonomic: "Родина Хетофорові — Chaetophoraceae",
            status: "Вразливий",
            count: "Трапляється поодиноко в болотах, ставках. Окол. м. Дніпропетровська; ставок в заплавні р. Самара, окол. м. Новомосковськ Дніпропетровської обл.; окол. м. Одеса, Одеської обл.; Кременчуцьке водосховище, Полтавська, Черкаська обл. Спостерігається тенденція до зникнення",
            danger: "Антропогенний вплив (евтрофування водойм)"
        }
    ];

    const moss = [{
            img: "./img/plants/sphagnum_subnitens.png",
            title: "Сфагн блискучий Sphagnum subnitens Russow et Warnst.",
            taxonomic: "Родина Сфагнові — Sphagnaceae",
            status: "Зникаючий",
            count: "Популяції нечисленні. Трапляється окремими дернинками. Більшість знахідок в Україні довоєнного періоду",
            danger: "На рівнині — осушення боліт та інші меліоративні роботи"
        },
        {
            img: "./img/plants/saelania_glaucescens.png",
            title: "Селанія сизувата Saelania glaucescens",
            taxonomic: "Родина Дитрихові — Ditrichaceae",
            status: "Рідкісний",
            count: "Зростає невеликими скупченнями та окремими особинами серед інших мохів",
            danger: "Не з’ясовані"
        }
    ];

    const lichens = [{
            img: "./img/plants/cladonia_stellaris.png",
            title: "Кладонія зірчаста, кладонія альпійська Cladonia stellaris",
            taxonomic: "Родина Кладонієві — Cladoniaceae",
            status: "Рідкісний",
            count: "Трапляється поодинці. Належить до видів, що дуже повільно відновлюють своє угруповання",
            danger: "Меліорація та знищення старих лісових масивів"
        },
        {
            img: "./img/plants/lasallia_rossica.png",
            title: "Ласалія російська Lasallia rossica Dombr.",
            taxonomic: "Родина Умбілікарієві — Umbilicariaceae",
            status: "Рідкісний",
            count: "Tрапляється групами, рідше поодинці",
            danger: "Едафічно-кліматичні фактори (зволоження субстрату, вологість повітря, освітленість місць зростання)"
        }
    ];

    let allCategoies = [corals, parasite, ring_worm, tarantula, shellfish, cat, cactus, mashroom, seaweed, moss, lichens];